const newsArr = [
  {
    id: "1",
    title: "Студенти Полтавської політехніки перемогли на Всеукраїнській олімпіаді",
    url_img: "images/olimpiada.jpg",
    description: "Команда факультету інформаційних технологій Полтавської політехніки здобула перше місце на Всеукраїнській студентській олімпіаді з програмування, яка відбулася в Києві. Студенти обійшли понад 40 університетів, продемонструвавши високий рівень знань та навичок в алгоритмуванні, математиці та розв'язанні задач з реального світу. Перемога забезпечила їм кваліфікацію на міжнародні змагання, які будуть проходити в США."
  },
  {
    id: "2",
    title: "Відкрито новий коворкінг-простір для студентів",
    url_img: "images/kovorking.jpg",
    description: "У головному корпусі Полтавської політехніки відкрили новий сучасний коворкінг-простір, який стане ідеальним місцем для роботи, навчання та зустрічей. Простір обладнано комфортними робочими місцями, доступом до Wi-Fi, проекторами для презентацій, а також зоною відпочинку з настільними іграми та кавою. Студенти можуть працювати над груповими проектами, проводити лекції та майстер-класи, а також використовувати коворкінг для навчання в будь-який час доби."
  },
  {
    id: "3",
    title: "Полтавська політехніка організувала благодійний студентський ярмарок",
    url_img: "images/yarmarok.jpg",
    description: "Студентська рада університету організувала благодійний ярмарок, під час якого студенти та викладачі продавали власноруч виготовлені вироби, домашню випічку та інші товари. Всі зібрані кошти були направлені на підтримку місцевої лікарні, де придбали медичне обладнання для дитячого відділення. Подія зібрала понад 500 учасників та стала символом єдності та соціальної відповідальності студентів."
  },
  {
    id: "4",
    title: "Проведено День першокурсника 2025",
    url_img: "images/pershokersnuk.jpg",
    description: "Університет Полтавська політехніка зустрічав своїх першокурсників на святі, яке стало традицією для нових студентів. День першокурсника включав розважальні заходи, концерти, флешмоби, спортивні змагання та інтерв'ю з викладачами. Студенти першого курсу ознайомилися з університетським життям, дізналися про важливі можливості для розвитку та долучилися до студентської спільноти."
  },
  {
    id: "5",
    title: "В університеті стартував проект «Eco System»",
    url_img: "images/ecoSystem.jpg",
    description: "Полтавська політехніка оголосила старт нового екологічного проєкту під назвою «Eco System», мета якого — зменшення викидів вуглекислого газу та збереження природних ресурсів. Студенти та викладачі вже працюють над впровадженням роздільного збору сміття на кампусі, встановленням енергоефективного освітлення та зеленою зоною для відпочинку. Проект має на меті не тільки покращити екологічний стан університету, але й виховувати у студентів свідоме ставлення до довкілля."
  },
  {
    id: "6",
    title: "Полтавські студенти створили мобільний застосунок для університету",
    url_img: "images/dodatok.jpg",
    description: "Група студентів факультету інформаційних технологій Полтавської політехніки розробила мобільний застосунок, який забезпечує зручний доступ до розкладу пар, новин університету, інформації про заходи та важливі оголошення. Додаток також включає функцію онлайн-реєстрації на курси та подачі заяв на стипендію, що полегшує студентське життя та дозволяє швидко отримувати необхідну інформацію."
  },
  {
    id: "7",
    title: "Проведено відкриту лекцію з підприємництва від CEO IT-компанії",
    url_img: "images/CEOIT.jpg",
    description: "До студентів Полтавської політехніки завітав CEO успішної української IT-компанії для проведення лекції з підприємництва. Він поділився власним досвідом створення бізнесу, розповів про етапи розвитку стартапу та важливість інновацій у сучасному бізнес-середовищі. Студенти мали можливість поставити питання та отримати корисні поради щодо кар'єри в сфері IT та підприємництва."
  },
  {
    id: "8",
    title: "Студентська рада провела турнір з настільного тенісу",
    url_img: "images/turnir.jpg",
    description: "Студентська рада організувала турнір з настільного тенісу, який зібрав більше 50 учасників з різних факультетів. Змагання пройшли в спортивному залі університету, а переможці отримали медалі та подарунки від університету. Подія стала чудовою нагодою для студентів знайти нових друзів, проявити спортивний дух та провести час з користю для здоров'я."
  },
  {
    id: "9",
    title: "Університет приєднався до міжнародного студентського обміну",
    url_img: "images/studObmin.jpg",
    description: "Полтавська політехніка підписала угоду з кількома європейськими університетами, що дозволить студентам взяти участь в програмі міжнародного обміну. Перші студенти вже вирушили на навчання до університетів Польщі та Німеччини в рамках програми Erasmus+. Це відкриває нові можливості для розвитку академічних та професійних навичок, а також дозволяє студентам поринути в культурні традиції інших країн."
  },
  {
    id: "10",
    title: "Полтавська політехніка відкрила фотозону до Дня студента",
    url_img: "images/photoZone.jpg",
    description: "До Дня студента в університеті Полтавська політехніка відкрила святкову фотозону, де студенти могли зробити пам'ятні фотографії з тематичними декораціями. Подія привабила багато студентів, адже це не тільки можливість запам'ятати важливу подію, але й познайомитися з новими друзями та отримати чудові кадри для своїх соцмереж."
  }
]

const listNews = document.getElementById("listNews")

function createListNews(){
    for (const news of newsArr) {
      const a = document.createElement("a")
      a.href = `#${news.id}`
      const div = document.createElement("div")
      div.classList.add("block")
      div.style.backgroundImage = `url(${news.url_img})`
      const h2 = document.createElement("h2")
      h2.innerText = news.title

      a.append(div)
      div.append(h2)
      listNews.append(a)
    }
}

createListNews()

const contNews = document.getElementById("contNews")

function createNews(){
  for (const news of newsArr) {
      const blockNews = document.createElement("div")
      blockNews.classList.add("blockNews")
      blockNews.id = news.id;
      const img = document.createElement("img")
      img.src = news.url_img
      const div = document.createElement("div")
      const h2 = document.createElement("h2")
      const p = document.createElement("p")
      h2.innerText = news.title
      p.innerText = news.description

      div.append(h2, p)
      blockNews.append(img, div)
      contNews.append(blockNews)
  }
}

createNews()